{
  "index": {
    "name": "c-cpp",
    "subtitle": "C/C++",
    "tags": ["language"],
    "about": "C is a powerful system programming language, and C++ is an excellent general purpose programming language with modern bells and whistles.",
    "site": "https://isocpp.org",
    "image": "c_cpp.jpg",
    "description": "Read the best free ebooks about C/C++ language.",
    "books": [
      {
        "title": "How to Think Like a Computer Scientist: C++",
        "url": "http://greenteapress.com/thinkcpp/index.html",
        "description": "The goal of this book is to teach you to think like a computer scientist. I like the way computer scientists think because they combine some of the best features of Mathematics, Engineering, and Natural Science. Like mathematicians, computer scientists use formal languages to denote ideas.",
        "author": "Allen Downey",
        "pages": 191,
        "year": 2012,
        "lang": "EN",
        "added_at": "20170315"
      },
      {
        "title": "An Introduction to GCC",
        "url": "http://www.network-theory.co.uk/docs/gccintro/",
        "description": "This manual provides a tutorial introduction to the GNU C and C++ compilers, gcc and g++. Many books teach the C and C++ languages, this book explains how to use the compiler itself. Based on years of observation of questions posted on mailing lists, it guides the reader straight to the important options of GCC!",
        "author": "Brian J. Gough",
        "pages": 144,
        "year": 2005,
        "lang": "EN",
        "added_at": "20170207"
      },
      {
        "title": "The C Book, second edition",
        "url": "http://publications.gbdirect.co.uk/c_book/",
        "description": "This is not a tutorial introduction to C programming. The book is designed for programmers who already have some experience of using a modern high-level procedural programming language.",
        "author": "Mike Banahan, Declan Brady and Mark Doran",
        "pages": 333,
        "year": 1991,
        "lang": "EN",
        "added_at": "20170207"
      },
      {
        "title": "Object-Oriented Programming in C",
        "url": "https://www.cs.rit.edu/~ats/books/ooc.pdf",
        "description": "Use ANSI C to discover how object-oriented programming is done, what its techniques are, why they help solve bigger problems, and how to harness generality and program to catch mistakes earlier.",
        "author": " Axel Schreiner",
        "pages": 221,
        "year": 1994,
        "lang": "EN",
        "added_at": "20161128"
      }
    ]
  }
}
