{
  "index": {
    "name": "csharp",
    "subtitle": "Csharp",
    "tags": ["language", "backend"],
    "about": "C# (pronounced as see sharp) is a multi-paradigm programming language encompassing strong typing, imperative, declarative, functional, generic, object-oriented (class-based), and component-oriented programming disciplines. It was developed by Microsoft within its .NET initiative and is one of the programming languages designed for the Common Language Infrastructure.",
    "site": "https://msdn.microsoft.com/en-us/library/z1zx9t92.aspx",
    "image": "csharp.jpg",
    "description": "Read the best free ebooks about C#",
    "books": [
      {
        "title": "SQL Server for C# Developers Succinctly",
        "description": "Developers of C# applications with a SQL Server database can learn to connect to a database using classic ADO.NET and look at different methods of developing databases using the Entity Framework. This book addresses common pitfalls, why databases run slowly, how to troubleshoot performance issues, and how to test and deploy SQL Server databases. The first half has a focus on C# and development while the second half focuses on troubleshooting using the SQL Server tools.",
        "author": "Sander Rossel",
        "pages": 96,
        "year": 2016,
        "lang": "EN",
        "added_at": "20190125",
        "url": "https://www.syncfusion.com/ebooks/sql_server_for_c_sharp_developers_succinctly"
      },
      {
        "title": "C# Succinctly",
        "description": "C# is a general purpose, object-oriented, component-based programming language. As a general purpose language, there are a number of ways to apply C# to accomplish many different tasks. With C# Succinctly by Joe Mayo, you will quickly learn the syntax you need to build your own C# applications. ",
        "author": "Joe Mayo",
        "pages": 98,
        "year": 2015,
        "lang": "EN",
        "added_at": "20161110",
        "url": "https://www.syncfusion.com/resources/techportal/details/ebooks/csharp"
      },
      {
        "title": "OOP in C# Succinctly",
        "description": "Object-Oriented Programming in C# Succinctly provides an introduction to OOP for C# developers. Author Sander Rossel provides overviews and numerous samples to guide readers towards OOP mastery.",
        "author": "Sander Rossel",
        "pages": 95,
        "year": 2016,
        "lang": "EN",
        "added_at": "20161110",
        "url": "https://www.syncfusion.com/resources/techportal/details/ebooks/oop-csharp"
      },
      {
        "title": "C# Code Contracts Succinctly",
        "description": "In C# Code Contracts Succinctly, author Dirk Strauss demonstrates how to use Code Contracts to validate logical correctness in code, how they can be integrated with abstract classes and interfaces, and even how they can be used to make writing documentation less painful.",
        "author": "Dirk Strauss",
        "pages": 90,
        "year": 2016,
        "lang": "EN",
        "added_at": "20161110",
        "url": "https://www.syncfusion.com/resources/techportal/details/ebooks/csharpcontracts"
      },
	    {
        "title": "Threading in C#",
        "description": "An extensive article on multithreading in C#. This tackles difficult issues such as thread safety, when to use Abort, Wait Handles vs Wait and Pulse, the implications of Apartment Threading in Windows Forms, using Thread Pooling, Synchronization Contexts, Memory Barriers and non-blocking synchronization constructs.",
        "author": "Joseph Albahari",
        "pages": 125,
        "year": 2011,
        "lang": "EN",
        "added_at": "20161115",
        "url": "http://www.albahari.com/threading/"
      }
    ]
  }
}
