{
  "index": {
    "name": "flutter",
    "subtitle": "Flutter",
    "tags": ["mobile"],
    "about": "Flutter is an open-source mobile application development SDK created by Google. It is used to develop applications for Android and iOS, as well as being the primary method of creating applications for Google Fuchsia.",
    "site": "https://flutter.io",
    "image": "flutter.jpg",
    "description": "Read the best free ebooks about Flutter mobile platform.",
    "books": [
      {
        "title": "Flutter UI Succinctly",
        "description": "Flutter made quite the impact when it landed in the cross-platform mobile framework landscape. Developed by Google, open source, targeting iOS and Android, smooth animations and motion, platform awareness, hot reload—the list of highlights goes on and on, demonstrating why Flutter is a worth any mobile developer’s attention. In Flutter UI Succinctly, Ed Freitas explores the essentials of constructing user interfaces with Flutter, showing off how a handful of Flutter’s built-in widgets and tools can serve as a springboard to creating apps with impressive interfaces.",
        "author": "Ed Freitas",
        "pages": 123,
        "year": 2021,
        "lang": "EN",
        "added_at": "20211015",
        "url": "https://www.syncfusion.com/succinctly-free-ebooks/flutter-ui-succinctly"
      },
      {
        "title": "Flutter Succinctly",
        "description": "In Flutter Succinctly, Ed Freitas will take you through creating a fully functional app to help you assess whether Flutter is the right choice for your mobile development needs.",
        "author": "Ed Freitas",
        "pages": 129,
        "year": 2019,
        "lang": "EN",
        "added_at": "20200918",
        "url": "https://www.syncfusion.com/ebooks/flutter-succinctly"
      },
      {
        "title": "Beginning App Development with Flutter: Create Cross-Platform Mobile Apps",
        "description": "This book breaks down complex concepts and tasks into easily digestible segments with examples, pictures, and hands-on labs with starters and solutions.",
        "author": "Rap Payne",
        "pages": 336,
        "year": 2019,
        "paid_book": true,
        "lang": "EN",
        "added_at": "20200918",
        "url": "https://amzn.to/3hJF3Ft"
      },
      {
        "title": "Flutter Tutorials Handbook",
        "description": "This cookbook contains recipes that demonstrate how to solve common problems while writing Flutter apps. Each recipe is self-contained and can be used as a reference to help you build up an application.",
        "author": "Raunak Hajela",
        "pages": 43,
        "year": 2018,
        "lang": "EN",
        "added_at": "20190214",
        "url": "https://kodestat.gitbook.io/flutter/"
      },
      {
        "title": "Flutter Cookbook",
        "description": "This cookbook contains recipes that demonstrate how to solve common problems while writing Flutter apps. Each recipe is self-contained and can be used as a reference to help you build up an application.",
        "author": "Google",
        "pages": 56,
        "year": 2018,
        "lang": "EN",
        "added_at": "20190126",
        "url": "https://flutter.io/docs/cookbook"
      }
    ]
  }
}
