{
  "index": {
    "name": "go",
    "subtitle": "Go",
    "tags": ["language", "backend"],
    "about": "Go is an open source programming language that makes it easy to build simple, reliable, and efficient software.",
    "site": "http://golang.org",
    "image": "go.jpg",
    "description": "Read the best free ebooks about Go language.",
    "books": [
      {
        "title": "Go Web Development Succinctly",
        "description": "Go is a modern programming language built to deal with modern programming challenges, such as concurrency and compilation. Designed specifically with the web in mind, Go is an excellent language for writing web applications, specifically for web services. In his second book on Go, Mark Lewin will take you through serving, routing, connecting to a data source, using the templating engine, working with cookies, and more. Use Go Web Development Succinctly to build hugely scalable web applications with ease.",
        "author": "Mark Lewin",
        "pages": 89,
        "year": 2017,
        "lang": "EN",
        "added_at": "20211015",
        "url": "https://www.syncfusion.com/succinctly-free-ebooks/go-web-development"
      },
      {
        "title": "Go Succinctly",
        "description": "The Go programming language is relatively small and concise, but its depth makes it an ideal option for solving modern-day development problems. In Go Succinctly, author Mark Lewin guides readers through the basics of Go, and he provides documentation and resources that allow users to dive into the language and learn it for themselves. By the end of the book, novices and experienced programmers alike will be conversant in a language quickly gaining traction around the world.",
        "author": "Mark Lewin",
        "pages": 104,
        "year": 2017,
        "lang": "EN",
        "added_at": "20211015",
        "url": "https://www.syncfusion.com/succinctly-free-ebooks/go-succinctly"
      },
      {
        "title": "Go Bootcamp",
        "url": "http://www.golangbootcamp.com/book",
        "description": "Everything you need to know to get started with Go.",
        "author": "Matt Aimonetti",
        "pages": 118,
        "year": 2014,
        "lang": "EN",
        "added_at": "20161111"
      },
      {
        "title": "Learning Go",
        "url": "https://www.miek.nl/go",
        "description": "Book for people who already know some programming languages and how to program.",
        "author": "Miek Gieben",
        "pages": 112,
        "year": 2015,
        "lang": "EN",
        "added_at": "20150414"
      },
      {
        "title": "Go by Example",
        "url": "https://gobyexample.com",
        "description": "Go by Example is a hands-on introduction to Go using annotated example programs.",
        "author": "Mark McGranaghan",
        "pages": 64,
        "year": 2013,
        "lang": "EN",
        "added_at": "20150414"
      },
      {
        "title": "The Little Go Book",
        "description": "The Little Go Book is a free introduction to Google's Go programming language. It's aimed at developers who might not be quite comfortable with the idea of pointers and static typing. It's longer than the other Little books, but hopefully still captures that little feeling.",
        "author": "Karl Seguin",
        "pages": 50,
        "year": 2014,
        "lang": "EN",
        "added_at": "20150201",
        "url": "http://openmymind.net/The-Little-Go-Book"
      },
      {
        "title": "Building web apps with Go",
        "description": "Learn how to build and deploy web applications with Go.",
        "author": "Jeremy Saenz",
        "pages": 24,
        "year": 2014,
        "lang": "EN",
        "added_at": "20150201",
        "url": "http://codegangsta.gitbooks.io/building-web-apps-with-go/"
      },
      {
        "title": "An Introduction to Programming in Go",
        "description": "Computer programming is the art, craft and science of writing programs which define how computers operate. This book will teach you how to write computer programs using a programming language designed by Google named Go.",
        "author": "Caleb Doxsey",
        "pages": 165,
        "year": 2012,
        "lang": "EN",
        "added_at": "20150201",
        "url": "http://www.golang-book.com/books/intro"
      },
      {
        "title": "Practical Cryptography With Go",
        "description": "This is an introduction to cryptography for developers. It assumes that you aren't looking for cryptographic theories, but practical ways to use cryptography in your projects. It covers the basic standard building blocks, and includes some sample code to help you get started.",
        "author": "Kyle Isom",
        "pages": 21,
        "year": 2014,
        "lang": "EN",
        "added_at": "20150407",
        "url": "https://leanpub.com/gocrypto/read?a=2hxrOg_7DAAAx2pWvoaFpT"
      }
    ]
  }
}
