{
  "index": {
    "name": "html",
    "subtitle": "HTML",
    "tags": ["frontend"],
    "about": "HTML is the language that describes the structure and the semantic content of a web document. Content within a web page is tagged with HTML elements and these elements form the building blocks of a website.",
    "site": "https://developer.mozilla.org/en/docs/Web/HTML",
    "image": "html.jpg",
    "description": "Read the best free ebooks about HTML.",
    "books": [
      {
        "title": "HTML5 Notes for Professionals book",
        "description": "The HTML5 Notes for Professionals book is compiled from Stack Overflow Documentation, the content is written by the beautiful people at Stack Overflow. Text content is released under Creative Commons BY-SA. See credits at the end of this book whom contributed to the various chapters. Images may be copyright of their respective owners unless otherwise specified.",
        "author": "GoalKicker",
        "pages": 122,
        "year": 2018,
        "lang": "EN",
        "added_at": "20190125",
        "url": "https://goalkicker.com/HTML5Book/"
      },
      {
        "title": "Thinking in HTML",
        "description": "Get started with JavaScript and learn one of the most important languages in web development today. With helpful tips and code examples, discover how you can create websites with impressive and dynamic functionality. Explore JavaScript’s in-built features and find out how to customize them in this accessible and free guide.",
        "author": "Aravind Shenoy",
        "pages": 43,
        "year": 2014,
        "lang": "EN",
        "added_at": "20180216",
        "url": "https://www.packtpub.com/packt/free-ebook/thinking-in-html2"
      },
      {
        "title": "HTML and CSS is hard",
        "description": "A friendly web development tutorial for complete beginners.",
        "author": "Oliver James",
        "pages": 200,
        "year": 2016,
        "lang": "EN",
        "added_at": "20170315",
        "url": "https://internetingishard.com/html-and-css/"
      },
      {
        "title": "HTML5 for Web Designers",
        "description": "HTML5 isn’t as confusing as it once was, but it still isn’t straightforward. It’s an evolutionary, rather than revolutionary, change in the ongoing story of markup—and if you’re currently creating websites with any version of HTML, you’re already using HTML5.",
        "author": "Jeremy Keith & Rachel Andrew",
        "pages": 92,
        "year": 2010,
        "lang": "EN",
        "added_at": "20161112",
        "url": "https://html5forwebdesigners.com/"
      },
      {
        "title": "Learn to Code HTML & CSS",
        "description": "Learn to Code HTML & CSS is an interactive beginner’s guide with one express goal: teach you how to develop and style websites with HTML and CSS. Outlining the fundamentals, this book covers all of the common elements of front-end design and development.",
        "author": "Shay Howe",
        "pages": 304,
        "year": 2013,
        "lang": "EN",
        "added_at": "20170130",
        "url": "http://learn.shayhowe.com/"
      }
    ]
  }
}
