{
  "index": {
    "name": "java",
    "subtitle": "Java",
    "tags": ["language", "backend"],
    "about": "Java is the foundation for virtually every type of networked application and is the global standard for developing and delivering embedded applications, games, Web content, and enterprise software. With more than 9 million developers worldwide, Java enables you to efficiently develop and deploy exciting applications and services.",
    "site": "https://www.oracle.com/java/index.html",
    "image": "java.jpg",
    "description": "Read the best free ebooks about Java language.",
    "books": [
      {
        "title": "Java Succinctly Part 2",
        "description": "In this second e-book on Java, Christopher Rose takes readers through some of the more advanced features of the language. Java Succinctly Part 2 explores powerful and practical features of Java, such as multithreading, building GUI applications, and 2-D graphics and game programming. Then learn techniques for using these mechanisms in coherent projects by building a calculator app and a simple game with the author.",
        "author": "Christopher Rose",
        "pages": 134,
        "year": 2017,
        "lang": "EN",
        "added_at": "20211015",
        "url": "https://www.syncfusion.com/succinctly-free-ebooks/java-succinctly-part-2"
      },
      {
        "title": "Java Succinctly Part 1",
        "description": "Java is a high-level, cross-platform, object-oriented programming language that allows applications to be written once and run on a multitude of different devices. Java applications are ubiquitous, and the language is consistently ranked as one of the most popular and dominant in the world. Christopher Rose’s Java Succinctly Part 1 describes the foundations of Java–from printing a line of text to the console, to inheritance hierarchies in object-oriented programming. The e-book covers practical aspects of programming, such as debugging and using an IDE, as well as the core mechanics of the language.",
        "author": "Christopher Rose",
        "pages": 125,
        "year": 2017,
        "lang": "EN",
        "added_at": "20211015",
        "url": "https://www.syncfusion.com/succinctly-free-ebooks/java-succinctly-part-1"
      },
      {
        "title": "The Java Web Scraping Handbook",
        "description": "This book will teach you how to extract data from any website with Java, how to deal with AJAX / Javascript heavy websites, break captchas, deploy your scrapers in the cloud and many other advanced techniques.",
        "author": "Kevin Sahin",
        "pages": 130,
        "year": 2019,
        "lang": "EN",
        "url": "https://www.scrapingbee.com/java-webscraping-book/",
        "added_at": "20200918"
      },
      {
        "title": "Think Java",
        "description": "Think Java is an introduction to computer science and programming intended for people with little or no experience. We start with the most basic concepts and are careful to define all terms when they are first used.",
        "author": "Allen Downey",
        "pages": 291,
        "year": 2016,
        "lang": "EN",
        "url": "http://greenteapress.com/wp/think-java/",
        "added_at": "20170315"
      },
      {
        "title": "Core Java - DZone Refcard",
        "url": "https://dzone.com/refcardz/core-java",
        "description": "This free, 6-page cheat sheet gives you an overview of key aspects of the Java language and references on the core library, commonly used tools, and new Java 8 features.",
        "author": "Cay Hortsmann & Ivan Ivanov",
        "pages": 6,
        "year": 2016,
        "lang": "EN",
        "added_at": "20161111"
      },
      {
        "title": "Java e Orientação Objetos",
        "description": "This is a free ebook which shows the main concepts about Object Oriented Programming using Java language.",
        "author": "Caelum",
        "pages": 304,
        "year": 2014,
        "lang": "BR",
        "added_at": "20150210",
        "url": "https://www.caelum.com.br/apostila-java-orientacao-objetos/"
      },
      {
        "title": "Java para Desenvolvimento Web",
        "description": "This is a free ebook which shows the main concepts about web developing system using JavaEE.",
        "author": "Caelum",
        "pages": 284,
        "year": 2014,
        "lang": "BR",
        "added_at": "20150210",
        "url": "https://www.caelum.com.br/apostila-java-web/"
      }
    ]
  }
}
